BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/edc/ATtiny214.PIC
        <edc:SFRDef edc:_addr="0xA41" edc:access="-nnn-nnn" edc:cname="CTRLB" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="CNTMODE" edc:desc="Timer Mode" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="INT" edc:desc="Periodic Interrupt" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TIMEOUT" edc:desc="Periodic Timeout" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="CAPT" edc:desc="Input Capture Event" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="FRQ" edc:desc="Input Capture Frequency measurement" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="PW" edc:desc="Input Capture Pulse-Width measurement" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="FRQPW" edc:desc="Input Capture Frequency and Pulse-Width measurement" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Shot" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="PWM8" edc:desc="8-bit PWM" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CCMPEN" edc:desc="Pin Output Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCMPINIT" edc:desc="Pin Initial State" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ASYNC" edc:desc="Asynchronous Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xA42" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0xA44" edc:access="-n-n---n" edc:cname="EVCTRL" edc:impl="0x51" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="CAPTEI" edc:desc="Event Input Enable" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="EDGE" edc:desc="Event Edge" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Input Capture Noise Cancellation Filter" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA45" edc:access="-------n" edc:cname="INTCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA46" edc:access="-------n" edc:cname="INTFLAGS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="CAPT" edc:desc="Capture or Timeout" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA47" edc:access="-------r" edc:cname="STATUS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="RUN" edc:desc="Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA48" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCB0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA49" edc:access="nnnnnnnn" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCB0"/>
        <edc:SFRDef edc:_addr="0xA4A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="TCB0"/>
        <edc:SFRDef edc:_addr="0xA4C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CCMP" edc:nzwidth="0x10" ltx:memberofperipheral="TCB0"/>
        <edc:AdjustPoint edc:_addr="0xA4E" edc:offset="0x32"/>
        <edc:SFRDef edc:_addr="0xA80" edc:access="-nnnnnnn" edc:cname="CTRLA" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNCPRES" edc:desc="Syncronization prescaler" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Selevted clock source divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Selevted clock source divided by 2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Selevted clock source divided by 4" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Selevted clock source divided by 8" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CNTPRES" edc:desc="counter prescaler" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Sync clock divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Sync clock divided by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Sync clock divided by 32" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="clock select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="20MHZ" edc:desc="20 MHz oscillator" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External clock" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="SYSCLK" edc:desc="System clock" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xA81" edc:access="------nn" edc:cname="CTRLB" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="WGMODE" edc:desc="Waveform generation mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="ONERAMP" edc:desc="One ramp mode" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="TWORAMP" edc:desc="Two ramp mode" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="FOURRAMP" edc:desc="Four ramp mode" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="DS" edc:desc="Dual slope mode" edc:when="(field &amp; 0x3) == 0x3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
